app/controllers/playlists_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 4 ORDER BY "users"."id" ASC LIMIT 1
---
	  def create
	     event = Event.create(params.permit(:name, :description, :start_time, :latitude, :longitude, :address))
	     friend_array = []

	     params[:participants].each do |participant|
	        friend = User.find(participant['id'])