app/controllers/playlists_controller.rb

SELECT "playlists".* FROM "playlists" INNER JOIN "playlist_users" ON "playlists"."id" = "playlist_users"."playlist_id" WHERE "playlist_users"."user_id" = $1  [["user_id", 2]]
---
	def index
      playlists = current_user.playlists
      playlists = playlists.map{|playlist|

INSERT INTO "playlists" ("created_at", "description", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Mon, 22 Dec 2014 19:43:37 UTC +00:00], ["description", "asd"], ["name", "asd"], ["updated_at", Mon, 22 Dec 2014 19:43:37 UTC +00:00]]
INSERT INTO "playlist_users" ("created_at", "playlist_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Mon, 22 Dec 2014 19:43:37 UTC +00:00], ["playlist_id", 1], ["updated_at", Mon, 22 Dec 2014 19:43:37 UTC +00:00], ["user_id", 4]]
---
	  def create
	     playlist = Playlist.create(params.permit(:name, :description))
	     users = playlist.users
	     if(!users)
	      	users = []
	     end
	     users.push(current_user)