app/controllers/videos_controller.rb

  def show
      playlist = Playlist.find(params[:id])
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT 1  [["id", "1"]]

  def create

     video = Video.create(params.permit(:name, :description, :playlist_id, :video_type, :source_id, :thumbnail_url, :thumbnail_width, :thumbnail_height))
---
INSERT INTO "videos" ("created_at", "description", "name", "playlist_id", "source_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Wed, 24 Dec 2014 05:55:34 UTC +00:00], ["description", "as2d"], ["name", "as3d"], ["playlist_id", 1], ["source_id", "asd1"], ["updated_at", Wed, 24 Dec 2014 05:55:34 UTC +00:00]]